OpenFOAM-9/chapter8/coFlowFlame2D/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 30000;

boundaryField
{
    fuel
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.000504;
        value           uniform 1;
    }
    air
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.019677;
        value           uniform 1;
    }
    outlet
    {
        type            zeroGradient;
    }
    axis
    {
        type            symmetryPlane;
    }
    wallUp
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value       uniform 30000;
    }
    "(front-1|front-2)"
    {
        type            wedge;
    }
    "(back-1|back-2)"
    {
        type            wedge;
    }
}


// ************************************************************************* //
