OpenFOAM-9/chapter8/coFlowFlame2D/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    solver          ode;    //EulerImplicit
    method          standard;
}

chemistry           on;

initialChemicalTimeStep 1e-07;

sequentialCoeffs
{
    cTauChem        0.001;
}

EulerImplicitCoeffs
{
    cTauChem        0.05;
    equilibriumRateLimiter off;
}

odeCoeffs
{
    /* solver          SIBS;
     eps             1e-4;
     scale           1;*/
     solver          Trapezoid;
     absTol          1e-8;
     relTol          1e-1;
}
/*
13
(
Euler
EulerSI
RKCK45
RKDP45
RKF45
Rosenbrock12
Rosenbrock23
Rosenbrock34
SIBS
Trapezoid
rodas23
rodas34
seulex
)
*/
#include "$FOAM_CASE/chemkin/reactions";

// ************************************************************************* //
