OpenFOAM-9/chapter8/coFlowFlame2D/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

combustionModel  PaSR; //EDC; laminar;

active  true;

PaSRCoeffs
{
    Cmix                0.15;
    turbulentReaction   on;
}

// ************************************************************************* //
/*
combustionModel  EDC;

EDCCoeffs
{
    version v2005;
}
