OpenFOAM-9/chapter8/coFlowFlame2D/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         multiComponentMixture;//reactingMixture;
    transport       sutherland;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

defaultSpecie N2;

//chemistryReader foamChemistryReader;
//foamChemistryFile "$FOAM_CASE/chemkin/reactions";
//foamChemistryThermoFile "$FOAM_CASE/chemkin/thermo.compressibleGas";

#include "$FOAM_CASE/chemkin/thermo.compressibleGas"
// ************************************************************************* //
