OpenFOAM-9/chapter8/coFlowFlame2D/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(

);

regions
(
    sphereToCell
    {
        centre (0.0 0.0 0.0);         // Center of Sphere
	radius 0.05;		        //-Radius 5-7
        fieldValues
        (
            volScalarFieldValue T 1800	//1383   1775	2226	300	

        );
    }
);

